import '../models/ti.dart';

class Day32 {
  static List<TI> getTiArray() {
    return [
      TI(
        text: "그리스 고서 rhetorica ad herennium[헤렌니우스에게 바치는 수사학]에 소개된 장소기억법에 대한 내용입니다.",
        imageAssetPath: 'assets/images/d32_1.png',
      ),
      TI(
        text: "기억의 궁전은 장소와 상으로 이루어집니다.\n스케치북(장소)에 물감(상상력)으로 그림(상)을 그릴 수 있습니다.",
        imageAssetPath: 'assets/images/d32_2.png',
      ),
      TI(
        text: "장소는 나무나 강과 같은 자연, 집이나 건축물, 또는 자신의 상상력을 더해 만들어 놓은 장면입니다.그림을 그릴 땐 하얀 스케치북이 필수겠죠.",
        imageAssetPath: 'assets/images/d32_6.png',
      ),
      TI(
        text: "장소는 순서대로 기억하고 있어야 합니다. 서울, 대전, 대구, 부산은 쉽지만 그 사이에 광주를 넣는다면 혼란스러울 것입니다. 꼬리에 꼬리를 무는 체인 아시죠!! 순서는 기억의 연쇄작용을 도와줍니다.",
        imageAssetPath: 'assets/images/d32_4.png',
      ),
      TI(
        text: "장소에 사람이나 사물이 너무 많다면 @.@ 혼란스럽습니다. 특색있는 간단한 장소가 모상을 놔두기 쉽습니다. 또한 장소는 적당한 크기가 좋습니다. 너무 크면 모상이 잘 안보이고, 너무 작으면 모상을 놔두기가 어렵습니다. 너무 밝거나 어두워도 안되며, 장소 사이의 간격도 쉽게 다음 장소가 보일 수 있도록 설정하는 것이 좋습니다.",
        imageAssetPath: 'assets/images/d32_3.png',
      ),
      TI(
        text: "(3세 이상 이용가능인데.....읔)\n모상은 모습, 형태, 흔적, 모사물 같은 것을 말합니다. 인간의 뇌는 익숙한 것 보다는 새로운 것,야한장면, 끔찍한것(바퀴벌레..?), 칼날에 베이는 느낌등 충격적인 것을 쉽게 기억합니다. 그래서 우습게도 남자는 야한 장면을 많이 사용하고, 여자는 감정적인 것들을 사용한다고 합니다. 야한 장면을 적극 활용하면 도움이 된다고 합니다. 참고로 이는 기억술이 천대받는 원인이 되기도 했습니다.",
        imageAssetPath: 'assets/images/d32_5.png',
      ),
      TI(
        text: "꾸준하게 장소를 확보해야 많은 것들을 담을 수 있습니다. 시행착오를 통해 어떤 장소와 모상이 좋은지,점차 알수 있을 겁니다. 화이팅! 바바이",
        imageAssetPath: 'assets/images/d32_7.png',
      ),
    ];
  }
}
