import '../models/ti.dart';

class Day32 {
  static List<TI> getTiArray() {
    return [
      TI(
        text: "그리스 고서 rhetorica ad herennium[헤렌니우스에게 바치는 수사학]에 소개된 장소기억법에 대한 내용입니다.",
        imageAssetPath: 'assets/images/d32_1.png',
      ),
      TI(
        text: "기억의 궁전은 장소와 상으로 이루어집니다.\n스케치북(장소)에 물감(상상력)으로 그림(상)을 그릴 수 있습니다.",
        imageAssetPath: 'assets/images/d32_2.png',
      ),
      TI(
        text: "장소는 나무나 강과 같은 자연, 집이나 건축물, 또는 자신의 상상력을 더해 만들어 놓은 장면입니다.그림을 그릴 땐 하얀 스케치북이 필수겠죠.",
        imageAssetPath: 'assets/images/d32_6.png',
      ),
      TI(
        text: "장소는 순서대로 기억하고 있어야 합니다. 서울, 대전, 대구, 부산은 쉽지만 그 사이에 광주를 넣는다면 헷갈리겠죠?? 꼬리에 꼬리를 무는 체인 아시죠!! 순서는 기억의 연쇄작용을 도와줍니다.",
        imageAssetPath: 'assets/images/d32_4.png',
      ),
      TI(
        text: "장소에 사람이나 사물이 너무 많다면 노노, 특색있는 간단한 장소에 모상을 놔둡시다. 또한 장소는 적당한 크기가 좋습니다. 실제로 걷는다고 생각합시다. 모상이 너무 밝거나 어두워도 안되며, 장소 사이의 간격도 쉽게 다음 장소가 보일 수 있도록 설정하는 것이 좋습니다.",
        imageAssetPath: 'assets/images/d32_3.png',
      ),
      TI(
        text: "모상은 모습, 형태, 흔적, 모사물 같은 것을 말합니다. 인간의 뇌는 익숙한 것 보다는 새로운 것,야한장면, 끔찍한것(바퀴벌레..?), 칼날에 베이는 느낌등 충격적인 것을 쉽게 기억합니다. 성별에 따라 남자는 야한 상상을, 여자는 감정적인 요소를 기억술에 많이 사용한다고 합니다. 야한 장면을 상상하는 기술은 고대에 기억술이 천대받는 원인이 되었다죠 헤헤.. vs [현세대 기억력 챔피언 도미니크 오브라이언은 반대주장을 합니다. 실제로 가본곳, 논리정연한 상상, 현실에서 일어날법한 일들 등을 잘 활용해야 한다고 합니다.*사실 저도 이쪽이 더 잘됨].",
        imageAssetPath: 'assets/images/d32_5.png',
      ),
      TI(
        text: "어떤 챔피언은 에베레스트산을 오르며, 기억력 수련을 했다고도 합니다. 사람마다 참 방법은 여러가지구나 싶기도 합니다. 꾸준하게 장소를 확보해야 많은 것들을 담을 수 있습니다. 시행착오를 통해 어떤 장소와 모상이 좋은지,점차 알수 있을 겁니다. 화이팅! 바바이",
        imageAssetPath: 'assets/images/d32_7.png',
      ),
    ];
  }
}
